f1::main()
f2::name_of_person()
f3::ExitApp
main()
{
	WinGetActiveStats, Title, Width, Height, X, Y
	Random, id, 0, 13
	x := 490 + (1430 - 490) / 13 * id
	if (id > 12)
		max_y := 1
	else
		max_y := 2
	Random, id, 0, max_y
	y := 405 + (650 - 405) / 2 * id
	x := Width * x / 1920
	y := Height * y / 1080
	MouseClick, left, x, y
}

name_of_person()
{
	Random, id, 1, 41
	array := ["Атлас", "Андроксус", "Бак", "Барик", "Вивиан", "Виктор", "Вилло", "Гровер", "Грок", "Дженос", "Дзин", "Дредж", "Дрогоз", "Иви", "Имани", "Инара", "Инь", "Кинесса", "Кога", "Король бомб", "Кэсси", "Лекс", "Лиан", "Макоа", "Мейв", "Моджи", "Мэл Дэмба", "Пип", "Рукус", "Серис", "Скай", "Стрикс", "Тайра", "Талус", "Терминус", "Торвальд", "Фернандо", "Фурия", "Хан", "Ша Линь", "Эш"]
	person := array[id]
	MsgBox, %person%
}